"""Константы для интеграции Bolid Orion"""

DOMAIN = "bolid_orion"

# MQTT топики
TOPIC_COMMAND = "WemosOrion/byteN"
TOPIC_ANSWER = "WemosOrion/answer"

# Сигнал для обновления статуса
SIGNAL_STATUS_UPDATE = f"{DOMAIN}_status_update"

# Типы Orion приборов
ORION_DEVICE_TYPES = {
    44: "С2000-БКИ",
    9: "С2000-КДЛ",
    7: "С2000-К",
    1: "Сигнал-20",
    2: "Сигнал-20П",
    3: "С2000-СП1",
    4: "С2000-4",
    8: "С2000-ИТ",
    10: "С2000-БИ/БКИ",
}

# Типы DPLS устройств
DPLS_DEVICE_TYPES = {
    90: "С2000-ИК исп.03",
    3: "АР1 исп.02",
    64: "ИПР 513-3АМ",
    207: "С2000-СП2",
    7: "АР2 исп.02",
    156: "С2000-СМК",
    46: "С2000-ИП-03",
    27: "ДИП-34А-01-02",
    29: "ДИП-34А-03",
    217: "С2000-СП4-220",
    113: "С2000-СМК",
    109: "С2000-ИК исп.03",
}

# Признаки ответов
RSP_ORION = 0
RSP_DPLS = 58
