"""Константы для интеграции Bolid Orion"""

DOMAIN = "bolid_orion"

# MQTT топики (фиксированные)
TOPIC_COMMAND = "WemosOrion/byteN"
TOPIC_ANSWER = "WemosOrion/answer"

# Таймауты
MQTT_RECONNECT_DELAY = 5
MQTT_KEEPALIVE = 60

# Типы приборов
DEVICE_TYPES = {
    1: "Сигнал-20",
    2: "Сигнал-20П",
    3: "С2000-СП1",
    4: "С2000-4",
    7: "С2000-К",
    8: "С2000-ИТ",
    9: "С2000-КДЛ",
    10: "С2000-БИ/БКИ",
    11: "Сигнал-20(вер. 02)",
    13: "С2000-КС",
    14: "С2000-АСПТ",
    15: "С2000-КПБ",
    16: "С2000-2",
    19: "УО-ОРИОН",
    20: "Рупор",
    21: "Рупор-Диспетчер исп.01",
    22: "С2000-ПТ",
    24: "УО-4С",
    25: "Поток-3Н",
    26: "Сигнал-20М",
    28: "С2000-БИ-01",
    30: "Рупор исп.01",
    31: "С2000-Adem",
    33: "РИП-12 исп.50, исп.51",
    34: "Сигнал-10",
    36: "С2000-ПП",
    38: "РИП-12 исп.54",
    39: "РИП-24 исп.50, исп.51",
    41: "С2000-КДЛ-2И",
    43: "С2000-PGE",
    44: "С2000-БКИ",
    45: "Поток-БКИ",
    46: "Рупор-200",
    47: "С2000-Периметр",
    48: "МИП-12",
    49: "МИП-24",
    53: "РИП-48 исп.01",
    54: "РИП-12 исп.56",
    55: "РИП-24 исп.56",
    59: "Рупор исп.02",
    61: "С2000-КДЛ-Modbus",
    66: "Рупор исп.03",
    67: "Рупор-300",
    76: "С2000-PGE исп.01",
    78: "РИП-24 исп.57",
    79: "ПКВ-РИП-12 исп.56",
    80: "ПКВ-РИП-24 исп.56",
    81: "С2000-КДЛ-2И исп.01",
    82: "ШКП-RS",
    85: "Микрофонная консоль-20",
    87: "Рупор-Диспетчер исп.02",
    88: "МИП-12 исп.11",
    89: "МИП-24 исп.11",
    90: "С2000-РПИ исп.02",
    92: "Рупор-75",
}
